NordicSemiconductor/nrfx/mdk/nrf54l15_enga_flpr.svd
        <register>
          <name>SENSRES</name>
          <description>NFC-A SENS_RES auto-response settings</description>
          <addressOffset>0x5A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>BITFRAMESDD</name>
              <description>Bit frame SDD as defined by the b5:b1 of byte 1 in SENS_RES response in the NFC Forum, NFC Digital Protocol Technical Specification</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDD00000</name>
                  <description>SDD pattern 00000</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDD00001</name>
                  <description>SDD pattern 00001</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDD00010</name>
                  <description>SDD pattern 00010</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDD00100</name>
                  <description>SDD pattern 00100</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDD01000</name>
                  <description>SDD pattern 01000</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDD10000</name>
                  <description>SDD pattern 10000</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFU5</name>
              <description>Reserved for future use. Shall be 0.</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>NFCIDSIZE</name>
              <description>NFCID1 size. This value is used by the auto collision resolution engine.</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NFCID1Single</name>
                  <description>NFCID1 size: single (4 bytes)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NFCID1Double</name>
                  <description>NFCID1 size: double (7 bytes)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NFCID1Triple</name>
                  <description>NFCID1 size: triple (10 bytes)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLATFCONFIG</name>
              <description>Tag platform configuration as defined by the b4:b1 of byte 2 in SENS_RES response in the NFC Forum, NFC Digital Protocol Technical Specification</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>RFU74</name>
              <description>Reserved for future use. Shall be 0.</description>
              <lsb>12</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SELRES</name>
          <description>NFC-A SEL_RES auto-response settings</description>
          <addressOffset>0x5A4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RFU10</name>
              <description>Reserved for future use. Shall be 0.</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CASCADE</name>
              <description>Cascade as defined by the b3 of SEL_RES response in the NFC Forum, NFC Digital Protocol Technical Specification (controlled by hardware, shall be 0)</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>RFU43</name>
              <description>Reserved for future use. Shall be 0.</description>
              <lsb>3</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>PROTOCOL</name>
              <description>Protocol as defined by the b7:b6 of SEL_RES response in the NFC Forum, NFC Digital Protocol Technical Specification</description>
              <lsb>5</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>RFU7</name>
              <description>Reserved for future use. Shall be 0.</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PADCONFIG</name>
          <description>NFC pad configuration</description>
          <addressOffset>0x6D4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable NFC pads</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>NFC pads are used as GPIO pins</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The NFC pads are configured as NFC antenna pins</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
